# MassSurfaceData Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
MassSurfaceData Members
MassSurfaceData Class Methods Properties See Also
---
The MassSurfaceData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.  (Inherited from Element.) |
| CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from Element.) |
| CanBeLocked | Identifies if the element can be locked.  (Inherited from Element.) |
| CanDeleteSubelement | Checks if given subelement can be removed from the element.  (Inherited from Element.) |
| CanHaveAnalyticalModel | Indicates whether the Element can have an Analytical Model.  (Inherited from Element.) |
| CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned.  (Inherited from Element.) |
| ChangeTypeId(ElementId) | Changes the type of the element.  (Inherited from Element.) |
| DeleteEntity | Deletes the existing entity created by %schema% in the element  (Inherited from Element.) |
| DeleteSubelement | Removes a subelement from the element.  (Inherited from Element.) |
| DeleteSubelements | Removes the subelements from the element.  (Inherited from Element.) |
| Dispose | (Inherited from Element.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAnalyticalModel | Retrieves writeable Analytical Model for Element.  (Inherited from Element.) |
| GetAnalyticalModelId | Retrieves the Element Id of the Analytical Model Element for this Element.  (Inherited from Element.) |
| GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element.  (Inherited from Element.) |
| GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.  (Inherited from Element.) |
| GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element.  (Inherited from Element.) |
| GetExternalFileReference | Gets information pertaining to the external file referenced by the element.  (Inherited from Element.) |
| GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
| GetExternalResourceReferences | Gets the full map of the external resource references referenced by the element.  (Inherited from Element.) |
| GetFaceReferences | Gets References to the faces that the MassSurfaceData provides properties for. |
| GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object.  (Inherited from Element.) |
| GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference.  (Inherited from Element.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMaterialArea | Gets the area of the material with the given id.  (Inherited from Element.) |
| GetMaterialIds | Gets the element ids of all materials present in the element.  (Inherited from Element.) |
| GetMaterialVolume | Gets the volume of the material with the given id.  (Inherited from Element.) |
| GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring.  (Inherited from Element.) |
| GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring.  (Inherited from Element.) |
| GetOrderedParameters | Gets the parameters associated to the element in order.  (Inherited from Element.) |
| GetParameter | Retrieves a parameter from the element given identifier. (Inherited from Element.) |
| GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.  (Inherited from Element.) |
| GetParameters | Retrieves the parameters from the element via the given name. (Inherited from Element.) |
| GetPhaseStatus | Gets the status of a given element in the input phase  (Inherited from Element.) |
| GetSubelements | Returns the collection of element subelements.  (Inherited from Element.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeId | Returns the identifier of this element's type.  (Inherited from Element.) |
| GetValidTypes()()()() | Obtains a set of types that are valid for this element.  (Inherited from Element.) |
| HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.  (Inherited from Element.) |
| IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsExternalFileReference | Determines whether this Element represents an external file.  (Inherited from Element.) |
| IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from Element.) |
| IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models.  (Inherited from Element.) |
| IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements.  (Inherited from Element.) |
| IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.  (Inherited from Element.) |
| IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.  (Inherited from Element.) |
| IsValidType(ElementId) | Checks if given type is valid for this element.  (Inherited from Element.) |
| LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from Element.) |
| RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type.  (Inherited from Element.) |
| RefersToExternalResourceReferences | Determines whether this Element uses external resources.  (Inherited from Element.) |
| SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.  (Inherited from Element.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Area | Area of the references that the MassSurfaceData provides properties for. |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CategoryIdForConceptualSurfaceType | Returns the mass subcategory ElementId used for ConceptualSurfaceType for this MassSurfaceData. |
| ConceptualConstructionId | The id of the conceptual construction associated with the reference surface. |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsConceptualConstructionByEnergyData | True when the ConceptualConstructionType id is synchronized to the EnergyDataSettings. False when the ConceptualConstructionType id is overridden for this MassSurfaceData. |
| IsGlazingShaded | Indicates if shade geometry is auto-generated on the top edge of auto-generated glazing. |
| IsSlab | Indicates if a floor is a slab. |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsUnderground | Indicates if the roof, floor, slab, or wall surface reference is underground. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| MassLevelDataId | The MassLevelData used when the surface is horizontal, planar, and at the same height as a MassLevelData related to the same mass as the referenced face. |
| MaterialId | The visualization material used for the surface for displaying the energy analytical model. |
| MaterialType | material type of mass zone |
| Name | A human readable name for the Element. (Inherited from Element.) |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| PercentageGlazing | The target percentage of the reference wall surface that is to be covered with automatically generated windows. Revit will use this number when determining the size, shape, and location of automatically generated windows. |
| PercentageSkylights | The target percentage of the reference roof surface that is to be covered with automatically generated skylights. Revit will use this number when determining the size, shape, and location of automatically generated skylights. |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| ReferenceElementId | The ElementId of the element whose face the MassSurfaceData primarily refers to. |
| ShadeDepth | How far any auto-generated shades should extend from the wall surface. |
| SillHeight | The height above the level where the bottoms of auto-generated windows will be located. |
| SkylightWidth | The length dimension to be used for the sides of each individual square skylight produced in the grid of auto-generated skylights. |
| SurfaceDataSource | Indicates whether the MassSurfaceData properties are driven by the EnergyDataSettings of the Document or are overridden for the surface. |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace